zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F82xxx/periph/PERI_DMA.h
/*
** ###################################################################
**     Processors:          MC56F82313VLC
**                          MC56F82316VLF
**                          MC56F82323VFM
**                          MC56F82623VLC
**                          MC56F82643VLC
**                          MC56F82646VLF
**                          MC56F82723VFM
**                          MC56F82723VLC
**                          MC56F82726VLF
**                          MC56F82728VLH
**                          MC56F82733MFM
**                          MC56F82733VFM
**                          MC56F82733VLC
**                          MC56F82736VLF
**                          MC56F82738VLH
**                          MC56F82743VFM
**                          MC56F82743VLC
**                          MC56F82746MLF
**                          MC56F82746VLF
**                          MC56F82748MLH
**                          MC56F82748VLH
**
**     Version:             rev. 1.0, 2024-10-29
**     Build:               b250520
**
**     Abstract:
**         CMSIS Peripheral Access Layer for DMA
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2020-12-11)
**         Initial version.
**     - rev. 1.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_DMA.h
 * @version 1.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for DMA
 *
 * CMSIS Peripheral Access Layer for DMA
 */

#if !defined(PERI_DMA_H_)
#define PERI_DMA_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MC56F82313VLC))
#include "MC56F82313_COMMON.h"
#elif (defined(CPU_MC56F82316VLF))
#include "MC56F82316_COMMON.h"
#elif (defined(CPU_MC56F82323VFM))
#include "MC56F82323_COMMON.h"
#elif (defined(CPU_MC56F82623VLC))
#include "MC56F82623_COMMON.h"
#elif (defined(CPU_MC56F82643VLC))
#include "MC56F82643_COMMON.h"
#elif (defined(CPU_MC56F82646VLF))
#include "MC56F82646_COMMON.h"
#elif (defined(CPU_MC56F82723VFM) || defined(CPU_MC56F82723VLC))
#include "MC56F82723_COMMON.h"
#elif (defined(CPU_MC56F82726VLF))
#include "MC56F82726_COMMON.h"
#elif (defined(CPU_MC56F82728VLH))
#include "MC56F82728_COMMON.h"
#elif (defined(CPU_MC56F82733MFM) || defined(CPU_MC56F82733VFM) || defined(CPU_MC56F82733VLC))
#include "MC56F82733_COMMON.h"
#elif (defined(CPU_MC56F82736VLF))
#include "MC56F82736_COMMON.h"
#elif (defined(CPU_MC56F82738VLH))
#include "MC56F82738_COMMON.h"
#elif (defined(CPU_MC56F82743VFM) || defined(CPU_MC56F82743VLC))
#include "MC56F82743_COMMON.h"
#elif (defined(CPU_MC56F82746MLF) || defined(CPU_MC56F82746VLF))
#include "MC56F82746_COMMON.h"
#elif (defined(CPU_MC56F82748MLH) || defined(CPU_MC56F82748VLH))
#include "MC56F82748_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
#if !defined(DMA_CHANNEL_REQUEST_SOURCE_T_)
#define DMA_CHANNEL_REQUEST_SOURCE_T_
/*!
 * @brief DMA channel request source
 *
 * Enumeration member bitfield:
 *   BIT8~BIT15: DMA Channel Number.
 *   BIT0~BIT7: DMA Channel Input.
 */
typedef enum _dma_channel_request_source
{
    kDmaCH0_SCI0_TE                 = 0x0000U,     /**< SCI0 Transmitter Empty */
    kDmaCH0_SPI0_RF                 = 0x0002U,     /**< SPI0 Receiver Full */
    kDmaCH0_IIC_ipd_Req             = 0x0004U,     /**< IIC DMA Req */
    kDmaCH0_TMRA0_CP                = 0x0005U,     /**< TMRA0 Capture */
    kDmaCH0_TMRA0_CMPLD1orTMRA1_CMPLD2 = 0x0006U,  /**< TMRA0 Compare1 or TMRA1 Compare2 */
    kDmaCH0_PWMA3_CP                = 0x0009U,     /**< Submodule3 Capture DMA Req */
    kDmaCH0_PWMA0_WR                = 0x000AU,     /**< SubModule0 Value write DMA Req */
    kDmaCH0_ADCA_ES                 = 0x000CU,     /**< ADCA(Cyclic) End of Scan */
    kDmaCH0_ADCB_ES                 = 0x000DU,     /**< ADCB(Cyclic) End of Scan */
    kDmaCH0_XBAR_DSC0               = 0x000FU,     /**< XBAR DMA Req 0 */
    kDmaCH1_SCI0_RF                 = 0x0101U,     /**< SCI0 Receiver Full */
    kDmaCH1_SPI0_TE                 = 0x0102U,     /**< SPI0 Transmitter Empty */
    kDmaCH1_IIC_ipd_Req             = 0x0104U,     /**< IIC DMA Req */
    kDmaCH1_TMRA1_CP                = 0x0105U,     /**< TMRA1 Capture */
    kDmaCH1_TMRA0_CMPLD2orTMRA1_CMPLD1 = 0x0106U,  /**< TMRA0 Compare2 or TMRA1 Compare1 */
    kDmaCH1_PWMA2_CP                = 0x0109U,     /**< Submodule2 Capture DMA Req */
    kDmaCH1_PWMA1_WR                = 0x010AU,     /**< SubModule1 Value write DMA Req */
    kDmaCH1_ADCA_ES                 = 0x010CU,     /**< ADCA(Cyclic) End of Scan */
    kDmaCH1_ADCB_ES                 = 0x010DU,     /**< ADCB(Cyclic) End of Scan */
    kDmaCH1_XBAR_DSC1               = 0x010FU,     /**< XBAR DMA Req 1 */
    kDmaCH2_SCI0_RF                 = 0x0201U,     /**< SCI0 Receiver Full */
    kDmaCH2_SPI0_RF                 = 0x0202U,     /**< SPI0 Receiver Full */
    kDmaCH2_IIC_ipd_Req             = 0x0204U,     /**< IIC DMA Req */
    kDmaCH2_TMRA2_CP                = 0x0205U,     /**< TMRA2 Capture */
    kDmaCH2_TMRA2_CMPLD1orTMRA3_CMPLD2 = 0x0206U,  /**< TMRA2 Compare1 or TMRA3 Compare2 */
    kDmaCH2_PWMA1_CP                = 0x0209U,     /**< Submodule1 Capture DMA Req */
    kDmaCH2_PWMA2_WR                = 0x020AU,     /**< SubModule2 Value write DMA Req */
    kDmaCH2_ADCA_ES                 = 0x020CU,     /**< ADCA(Cyclic) End of Scan */
    kDmaCH2_ADCB_ES                 = 0x020DU,     /**< ADCB(Cyclic) End of Scan */
    kDmaCH2_XBAR_DSC2               = 0x020FU,     /**< XBAR DMA Req 2 */
    kDmaCH3_SCI0_TE                 = 0x0300U,     /**< SCI0 Transmitter Empty */
    kDmaCH3_SPI0_TE                 = 0x0302U,     /**< SPI0 Transmitter Empty */
    kDmaCH3_IIC_ipd_Req             = 0x0304U,     /**< IIC DMA Req */
    kDmaCH3_TMRA3_CP                = 0x0305U,     /**< TMRA3 Capture */
    kDmaCH3_TMRA2_CMPLD2orTMRA3_CMPLD1 = 0x0306U,  /**< TMRA2 Compare2 or TMRA3 Compare1 */
    kDmaCH3_PWMA0_CP                = 0x0309U,     /**< Submodule0 Capture DMA Req */
    kDmaCH3_PWMA3_WR                = 0x030AU,     /**< SubModule3 Value write DMA Req */
    kDmaCH3_ADCA_ES                 = 0x030CU,     /**< ADCA(Cyclic) End of Scan */
    kDmaCH3_ADCB_ES                 = 0x030DU,     /**< ADCB(Cyclic) End of Scan */
    kDmaCH3_XBAR_DSC3               = 0x030FU,     /**< XBAR DMA Req 3 */
    kDmaCH0_SCI1_RF                 = 0x0001U,     /**< SCI1 Receiver Full */
    kDmaCH0_DACB_FIFO               = 0x000BU,     /**< 12bit DACB FIFO Water Mark */
    kDmaCH1_SCI1_TE                 = 0x0100U,     /**< SCI1 Transmitter Empty */
    kDmaCH1_DACA_FIFO               = 0x010BU,     /**< 12bit DACA FIFO Water Mark */
    kDmaCH2_SCI1_TE                 = 0x0200U,     /**< SCI1 Transmitter Empty */
    kDmaCH2_DACB_FIFO               = 0x020BU,     /**< 12bit DACB FIFO Water Mark */
    kDmaCH3_SCI1_RF                 = 0x0301U,     /**< SCI1 Receiver Full */
    kDmaCH3_DACA_FIFO               = 0x030BU,     /**< 12bit DACA FIFO Water Mark */
    kDmaCH0_SPI1_TE                 = 0x0003U,     /**< SPI1 Transmitter Empty */
    kDmaCH1_SPI1_RF                 = 0x0103U,     /**< SPI1 Receiver Full */
    kDmaCH2_SPI1_TE                 = 0x0203U,     /**< SPI1 Transmitter Empty */
    kDmaCH3_SPI1_RF                 = 0x0303U,     /**< SPI1 Receiver Full */
} dma_channel_request_source_t;
#endif /* DMA_CHANNEL_REQUEST_SOURCE_T_ */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


