zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F82xxx/periph/PERI_DMA.h
/*
** Start of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- DMA Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA_Peripheral_Access_Layer DMA Peripheral Access Layer
 * @{
 */

/** DMA - Size of Registers Arrays */
#define DMA_DMA_COUNT                             4u

/** DMA - Register Layout Typedef */
typedef struct {
  __IO uint32_t REQC;                              /**< DMA Request Control Register, offset: 0x0 */
       uint16_t RESERVED_0[126];
  struct {                                         /* offset: 0x80, array step: 0x8 */
    __IO uint32_t SAR;                               /**< Source Address Register, array offset: 0x80, array step: 0x8 */
    __IO uint32_t DAR;                               /**< Destination Address Register, array offset: 0x82, array step: 0x8 */
    __IO uint32_t DSR_BCR;                           /**< DMA Status Register / Byte Count Register, array offset: 0x84, array step: 0x8 */
    __IO uint32_t DCR;                               /**< DMA Control Register, array offset: 0x86, array step: 0x8 */
  } DMA[DMA_DMA_COUNT];
} DMA_Type;

/* ----------------------------------------------------------------------------
   -- DMA Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA_Register_Masks DMA Register Masks
 * @{
 */

/*! @name REQC - DMA Request Control Register */
/*! @{ */

#define DMA_REQC_DMAC3_MASK                      (0xFUL)
#define DMA_REQC_DMAC3_SHIFT                     (0UL)
/*! DMAC3 - DMA channel 3
 *  0b0000..Select request 0 as the source
 *  0b0001..Select request 1 as the source
 *  0b0010..Select request 2 as the source
 *  0b0011..Select request 3 as the source
 *  0b0100..Select request 4 as the source
 *  0b0101..Select request 5 as the source
 *  0b0110..Select request 6 as the source
 *  0b0111..Select request 7 as the source
 *  0b1000..Select request 8 as the source
 *  0b1001..Select request 9 as the source
 *  0b1010..Select request 10 as the source
 *  0b1011..Select request 11 as the source
 *  0b1100..Select request 12 as the source
 *  0b1101..Select request 13 as the source
 *  0b1110..Select request 14 as the source
 *  0b1111..Select request 15 as the source
 */
#define DMA_REQC_DMAC3(x)                        (((uint32_t)(((uint32_t)(x)) << DMA_REQC_DMAC3_SHIFT)) & DMA_REQC_DMAC3_MASK)

#define DMA_REQC_CFSM3_MASK                      (0x80UL)
#define DMA_REQC_CFSM3_SHIFT                     (7UL)
/*! CFSM3 - Clear state machine control 3
 *  0b0..No effect
 *  0b1..Clear state machine for DMA channel 3
 */
#define DMA_REQC_CFSM3(x)                        (((uint32_t)(((uint32_t)(x)) << DMA_REQC_CFSM3_SHIFT)) & DMA_REQC_CFSM3_MASK)

#define DMA_REQC_DMAC2_MASK                      (0xF00UL)
#define DMA_REQC_DMAC2_SHIFT                     (8UL)
/*! DMAC2 - DMA channel 2
 *  0b0000..Select request 0 as the source
 *  0b0001..Select request 1 as the source
 *  0b0010..Select request 2 as the source
 *  0b0011..Select request 3 as the source
 *  0b0100..Select request 4 as the source
 *  0b0101..Select request 5 as the source
 *  0b0110..Select request 6 as the source
 *  0b0111..Select request 7 as the source
 *  0b1000..Select request 8 as the source
 *  0b1001..Select request 9 as the source
 *  0b1010..Select request 10 as the source
 *  0b1011..Select request 11 as the source
 *  0b1100..Select request 12 as the source
 *  0b1101..Select request 13 as the source
 *  0b1110..Select request 14 as the source
 *  0b1111..Select request 15 as the source
 */
#define DMA_REQC_DMAC2(x)                        (((uint32_t)(((uint32_t)(x)) << DMA_REQC_DMAC2_SHIFT)) & DMA_REQC_DMAC2_MASK)

#define DMA_REQC_CFSM2_MASK                      (0x8000UL)
#define DMA_REQC_CFSM2_SHIFT                     (15UL)
/*! CFSM2 - Clear state machine control 2
 *  0b0..No effect
 *  0b1..Clear state machine for DMA channel 2
 */
#define DMA_REQC_CFSM2(x)                        (((uint32_t)(((uint32_t)(x)) << DMA_REQC_CFSM2_SHIFT)) & DMA_REQC_CFSM2_MASK)

#define DMA_REQC_DMAC1_MASK                      (0xF0000UL)
#define DMA_REQC_DMAC1_SHIFT                     (16UL)
/*! DMAC1 - DMA channel 1
 *  0b0000..Select request 0 as the source
 *  0b0001..Select request 1 as the source
 *  0b0010..Select request 2 as the source
 *  0b0011..Select request 3 as the source
 *  0b0100..Select request 4 as the source
 *  0b0101..Select request 5 as the source
 *  0b0110..Select request 6 as the source
 *  0b0111..Select request 7 as the source
 *  0b1000..Select request 8 as the source
 *  0b1001..Select request 9 as the source
 *  0b1010..Select request 10 as the source
 *  0b1011..Select request 11 as the source
 *  0b1100..Select request 12 as the source
 *  0b1101..Select request 13 as the source
 *  0b1110..Select request 14 as the source
 *  0b1111..Select request 15 as the source
 */
#define DMA_REQC_DMAC1(x)                        (((uint32_t)(((uint32_t)(x)) << DMA_REQC_DMAC1_SHIFT)) & DMA_REQC_DMAC1_MASK)

#define DMA_REQC_CFSM1_MASK                      (0x800000UL)
#define DMA_REQC_CFSM1_SHIFT                     (23UL)
/*! CFSM1 - Clear state machine control 1
 *  0b0..No effect
 *  0b1..Clear state machine for DMA channel 1
 */
#define DMA_REQC_CFSM1(x)                        (((uint32_t)(((uint32_t)(x)) << DMA_REQC_CFSM1_SHIFT)) & DMA_REQC_CFSM1_MASK)

#define DMA_REQC_DMAC0_MASK                      (0xF000000UL)
#define DMA_REQC_DMAC0_SHIFT                     (24UL)
/*! DMAC0 - DMA channel 0
 *  0b0000..Select request 0 as the source
 *  0b0001..Select request 1 as the source
 *  0b0010..Select request 2 as the source
 *  0b0011..Select request 3 as the source
 *  0b0100..Select request 4 as the source
 *  0b0101..Select request 5 as the source
 *  0b0110..Select request 6 as the source
 *  0b0111..Select request 7 as the source
 *  0b1000..Select request 8 as the source
 *  0b1001..Select request 9 as the source
 *  0b1010..Select request 10 as the source
 *  0b1011..Select request 11 as the source
 *  0b1100..Select request 12 as the source
 *  0b1101..Select request 13 as the source
 *  0b1110..Select request 14 as the source
 *  0b1111..Select request 15 as the source
 */
#define DMA_REQC_DMAC0(x)                        (((uint32_t)(((uint32_t)(x)) << DMA_REQC_DMAC0_SHIFT)) & DMA_REQC_DMAC0_MASK)

#define DMA_REQC_CFSM0_MASK                      (0x80000000UL)
#define DMA_REQC_CFSM0_SHIFT                     (31UL)
/*! CFSM0 - Clear state machine control 0
 *  0b0..No effect
 *  0b1..Clear state machine for DMA channel 0
 */
#define DMA_REQC_CFSM0(x)                        (((uint32_t)(((uint32_t)(x)) << DMA_REQC_CFSM0_SHIFT)) & DMA_REQC_CFSM0_MASK)
/*! @} */

